cases/taylor-couette-3d/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Generated: 2025-10-26 15:52:11            |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Taylor-Couette 3D mesh with GGI interfaces
// Generated by: generate_blockmesh_ggi.py
//
// Geometry:
//   Inner radius (r_i):      0.025 m
//   Interface radius:        0.0375 m
//   Outer radius (r_o):      0.05 m
//   Height (H):              0.2 m
//
// Mesh parameters:
//   Radial (inner):          10 cells
//   Radial (outer):          10 cells
//   Circumferential:         32 cells (per sector: 4)
//   Axial:                   20 cells
//   Sectors:                 8
//
// Topology:
//   - Inner ring: vertices 0-31, blocks 0-7
//   - Outer ring: vertices 32-63, blocks 8-15
//   - Interface vertices are DUPLICATED (disconnected topology for GGI)

convertToMeters 1;

vertices
(
    (0.02500000 0.00000000 0.00000000) // 0 - Inner ring, r=0.025, θ=0.0°, z=0.0
    (0.01767767 0.01767767 0.00000000) // 1 - Inner ring, r=0.025, θ=45.0°, z=0.0
    (0.00000000 0.02500000 0.00000000) // 2 - Inner ring, r=0.025, θ=90.0°, z=0.0
    (-0.01767767 0.01767767 0.00000000) // 3 - Inner ring, r=0.025, θ=135.0°, z=0.0
    (-0.02500000 0.00000000 0.00000000) // 4 - Inner ring, r=0.025, θ=180.0°, z=0.0
    (-0.01767767 -0.01767767 0.00000000) // 5 - Inner ring, r=0.025, θ=225.0°, z=0.0
    (-0.00000000 -0.02500000 0.00000000) // 6 - Inner ring, r=0.025, θ=270.0°, z=0.0
    (0.01767767 -0.01767767 0.00000000) // 7 - Inner ring, r=0.025, θ=315.0°, z=0.0
    (0.02500000 0.00000000 0.20000000) // 8 - Inner ring, r=0.025, θ=0.0°, z=0.2
    (0.01767767 0.01767767 0.20000000) // 9 - Inner ring, r=0.025, θ=45.0°, z=0.2
    (0.00000000 0.02500000 0.20000000) // 10 - Inner ring, r=0.025, θ=90.0°, z=0.2
    (-0.01767767 0.01767767 0.20000000) // 11 - Inner ring, r=0.025, θ=135.0°, z=0.2
    (-0.02500000 0.00000000 0.20000000) // 12 - Inner ring, r=0.025, θ=180.0°, z=0.2
    (-0.01767767 -0.01767767 0.20000000) // 13 - Inner ring, r=0.025, θ=225.0°, z=0.2
    (-0.00000000 -0.02500000 0.20000000) // 14 - Inner ring, r=0.025, θ=270.0°, z=0.2
    (0.01767767 -0.01767767 0.20000000) // 15 - Inner ring, r=0.025, θ=315.0°, z=0.2
    (0.03750000 0.00000000 0.00000000) // 16 - Inner ring, r=0.0375, θ=0.0°, z=0.0
    (0.02651650 0.02651650 0.00000000) // 17 - Inner ring, r=0.0375, θ=45.0°, z=0.0
    (0.00000000 0.03750000 0.00000000) // 18 - Inner ring, r=0.0375, θ=90.0°, z=0.0
    (-0.02651650 0.02651650 0.00000000) // 19 - Inner ring, r=0.0375, θ=135.0°, z=0.0
    (-0.03750000 0.00000000 0.00000000) // 20 - Inner ring, r=0.0375, θ=180.0°, z=0.0
    (-0.02651650 -0.02651650 0.00000000) // 21 - Inner ring, r=0.0375, θ=225.0°, z=0.0
    (-0.00000000 -0.03750000 0.00000000) // 22 - Inner ring, r=0.0375, θ=270.0°, z=0.0
    (0.02651650 -0.02651650 0.00000000) // 23 - Inner ring, r=0.0375, θ=315.0°, z=0.0
    (0.03750000 0.00000000 0.20000000) // 24 - Inner ring, r=0.0375, θ=0.0°, z=0.2
    (0.02651650 0.02651650 0.20000000) // 25 - Inner ring, r=0.0375, θ=45.0°, z=0.2
    (0.00000000 0.03750000 0.20000000) // 26 - Inner ring, r=0.0375, θ=90.0°, z=0.2
    (-0.02651650 0.02651650 0.20000000) // 27 - Inner ring, r=0.0375, θ=135.0°, z=0.2
    (-0.03750000 0.00000000 0.20000000) // 28 - Inner ring, r=0.0375, θ=180.0°, z=0.2
    (-0.02651650 -0.02651650 0.20000000) // 29 - Inner ring, r=0.0375, θ=225.0°, z=0.2
    (-0.00000000 -0.03750000 0.20000000) // 30 - Inner ring, r=0.0375, θ=270.0°, z=0.2
    (0.02651650 -0.02651650 0.20000000) // 31 - Inner ring, r=0.0375, θ=315.0°, z=0.2
    (0.03750000 0.00000000 0.00000000) // 32 - Outer ring, r=0.0375, θ=0.0°, z=0.0 [DUP]
    (0.02651650 0.02651650 0.00000000) // 33 - Outer ring, r=0.0375, θ=45.0°, z=0.0 [DUP]
    (0.00000000 0.03750000 0.00000000) // 34 - Outer ring, r=0.0375, θ=90.0°, z=0.0 [DUP]
    (-0.02651650 0.02651650 0.00000000) // 35 - Outer ring, r=0.0375, θ=135.0°, z=0.0 [DUP]
    (-0.03750000 0.00000000 0.00000000) // 36 - Outer ring, r=0.0375, θ=180.0°, z=0.0 [DUP]
    (-0.02651650 -0.02651650 0.00000000) // 37 - Outer ring, r=0.0375, θ=225.0°, z=0.0 [DUP]
    (-0.00000000 -0.03750000 0.00000000) // 38 - Outer ring, r=0.0375, θ=270.0°, z=0.0 [DUP]
    (0.02651650 -0.02651650 0.00000000) // 39 - Outer ring, r=0.0375, θ=315.0°, z=0.0 [DUP]
    (0.03750000 0.00000000 0.20000000) // 40 - Outer ring, r=0.0375, θ=0.0°, z=0.2 [DUP]
    (0.02651650 0.02651650 0.20000000) // 41 - Outer ring, r=0.0375, θ=45.0°, z=0.2 [DUP]
    (0.00000000 0.03750000 0.20000000) // 42 - Outer ring, r=0.0375, θ=90.0°, z=0.2 [DUP]
    (-0.02651650 0.02651650 0.20000000) // 43 - Outer ring, r=0.0375, θ=135.0°, z=0.2 [DUP]
    (-0.03750000 0.00000000 0.20000000) // 44 - Outer ring, r=0.0375, θ=180.0°, z=0.2 [DUP]
    (-0.02651650 -0.02651650 0.20000000) // 45 - Outer ring, r=0.0375, θ=225.0°, z=0.2 [DUP]
    (-0.00000000 -0.03750000 0.20000000) // 46 - Outer ring, r=0.0375, θ=270.0°, z=0.2 [DUP]
    (0.02651650 -0.02651650 0.20000000) // 47 - Outer ring, r=0.0375, θ=315.0°, z=0.2 [DUP]
    (0.05000000 0.00000000 0.00000000) // 48 - Outer ring, r=0.05, θ=0.0°, z=0.0
    (0.03535534 0.03535534 0.00000000) // 49 - Outer ring, r=0.05, θ=45.0°, z=0.0
    (0.00000000 0.05000000 0.00000000) // 50 - Outer ring, r=0.05, θ=90.0°, z=0.0
    (-0.03535534 0.03535534 0.00000000) // 51 - Outer ring, r=0.05, θ=135.0°, z=0.0
    (-0.05000000 0.00000000 0.00000000) // 52 - Outer ring, r=0.05, θ=180.0°, z=0.0
    (-0.03535534 -0.03535534 0.00000000) // 53 - Outer ring, r=0.05, θ=225.0°, z=0.0
    (-0.00000000 -0.05000000 0.00000000) // 54 - Outer ring, r=0.05, θ=270.0°, z=0.0
    (0.03535534 -0.03535534 0.00000000) // 55 - Outer ring, r=0.05, θ=315.0°, z=0.0
    (0.05000000 0.00000000 0.20000000) // 56 - Outer ring, r=0.05, θ=0.0°, z=0.2
    (0.03535534 0.03535534 0.20000000) // 57 - Outer ring, r=0.05, θ=45.0°, z=0.2
    (0.00000000 0.05000000 0.20000000) // 58 - Outer ring, r=0.05, θ=90.0°, z=0.2
    (-0.03535534 0.03535534 0.20000000) // 59 - Outer ring, r=0.05, θ=135.0°, z=0.2
    (-0.05000000 0.00000000 0.20000000) // 60 - Outer ring, r=0.05, θ=180.0°, z=0.2
    (-0.03535534 -0.03535534 0.20000000) // 61 - Outer ring, r=0.05, θ=225.0°, z=0.2
    (-0.00000000 -0.05000000 0.20000000) // 62 - Outer ring, r=0.05, θ=270.0°, z=0.2
    (0.03535534 -0.03535534 0.20000000) // 63 - Outer ring, r=0.05, θ=315.0°, z=0.2
);

blocks
(
    hex (0 16 17 1 8 24 25 9) (10 4 20) simpleGrading (1 1 1) // 0 - Inner ring sector 0
    hex (1 17 18 2 9 25 26 10) (10 4 20) simpleGrading (1 1 1) // 1 - Inner ring sector 1
    hex (2 18 19 3 10 26 27 11) (10 4 20) simpleGrading (1 1 1) // 2 - Inner ring sector 2
    hex (3 19 20 4 11 27 28 12) (10 4 20) simpleGrading (1 1 1) // 3 - Inner ring sector 3
    hex (4 20 21 5 12 28 29 13) (10 4 20) simpleGrading (1 1 1) // 4 - Inner ring sector 4
    hex (5 21 22 6 13 29 30 14) (10 4 20) simpleGrading (1 1 1) // 5 - Inner ring sector 5
    hex (6 22 23 7 14 30 31 15) (10 4 20) simpleGrading (1 1 1) // 6 - Inner ring sector 6
    hex (7 23 16 0 15 31 24 8) (10 4 20) simpleGrading (1 1 1) // 7 - Inner ring sector 7
    hex (32 48 49 33 40 56 57 41) (10 4 20) simpleGrading (1 1 1) // 8 - Outer ring sector 0
    hex (33 49 50 34 41 57 58 42) (10 4 20) simpleGrading (1 1 1) // 9 - Outer ring sector 1
    hex (34 50 51 35 42 58 59 43) (10 4 20) simpleGrading (1 1 1) // 10 - Outer ring sector 2
    hex (35 51 52 36 43 59 60 44) (10 4 20) simpleGrading (1 1 1) // 11 - Outer ring sector 3
    hex (36 52 53 37 44 60 61 45) (10 4 20) simpleGrading (1 1 1) // 12 - Outer ring sector 4
    hex (37 53 54 38 45 61 62 46) (10 4 20) simpleGrading (1 1 1) // 13 - Outer ring sector 5
    hex (38 54 55 39 46 62 63 47) (10 4 20) simpleGrading (1 1 1) // 14 - Outer ring sector 6
    hex (39 55 48 32 47 63 56 40) (10 4 20) simpleGrading (1 1 1) // 15 - Outer ring sector 7
);

edges
(
    arc 0 1 (0.02309699 0.00956709 0.00000000)
    arc 16 17 (0.03464548 0.01435063 0.00000000)
    arc 8 9 (0.02309699 0.00956709 0.20000000)
    arc 24 25 (0.03464548 0.01435063 0.20000000)
    arc 1 2 (0.00956709 0.02309699 0.00000000)
    arc 17 18 (0.01435063 0.03464548 0.00000000)
    arc 9 10 (0.00956709 0.02309699 0.20000000)
    arc 25 26 (0.01435063 0.03464548 0.20000000)
    arc 2 3 (-0.00956709 0.02309699 0.00000000)
    arc 18 19 (-0.01435063 0.03464548 0.00000000)
    arc 10 11 (-0.00956709 0.02309699 0.20000000)
    arc 26 27 (-0.01435063 0.03464548 0.20000000)
    arc 3 4 (-0.02309699 0.00956709 0.00000000)
    arc 19 20 (-0.03464548 0.01435063 0.00000000)
    arc 11 12 (-0.02309699 0.00956709 0.20000000)
    arc 27 28 (-0.03464548 0.01435063 0.20000000)
    arc 4 5 (-0.02309699 -0.00956709 0.00000000)
    arc 20 21 (-0.03464548 -0.01435063 0.00000000)
    arc 12 13 (-0.02309699 -0.00956709 0.20000000)
    arc 28 29 (-0.03464548 -0.01435063 0.20000000)
    arc 5 6 (-0.00956709 -0.02309699 0.00000000)
    arc 21 22 (-0.01435063 -0.03464548 0.00000000)
    arc 13 14 (-0.00956709 -0.02309699 0.20000000)
    arc 29 30 (-0.01435063 -0.03464548 0.20000000)
    arc 6 7 (0.00956709 -0.02309699 0.00000000)
    arc 22 23 (0.01435063 -0.03464548 0.00000000)
    arc 14 15 (0.00956709 -0.02309699 0.20000000)
    arc 30 31 (0.01435063 -0.03464548 0.20000000)
    arc 7 0 (0.02309699 -0.00956709 0.00000000)
    arc 23 16 (0.03464548 -0.01435063 0.00000000)
    arc 15 8 (0.02309699 -0.00956709 0.20000000)
    arc 31 24 (0.03464548 -0.01435063 0.20000000)
    arc 32 33 (0.03464548 0.01435063 0.00000000)
    arc 48 49 (0.04619398 0.01913417 0.00000000)
    arc 40 41 (0.03464548 0.01435063 0.20000000)
    arc 56 57 (0.04619398 0.01913417 0.20000000)
    arc 33 34 (0.01435063 0.03464548 0.00000000)
    arc 49 50 (0.01913417 0.04619398 0.00000000)
    arc 41 42 (0.01435063 0.03464548 0.20000000)
    arc 57 58 (0.01913417 0.04619398 0.20000000)
    arc 34 35 (-0.01435063 0.03464548 0.00000000)
    arc 50 51 (-0.01913417 0.04619398 0.00000000)
    arc 42 43 (-0.01435063 0.03464548 0.20000000)
    arc 58 59 (-0.01913417 0.04619398 0.20000000)
    arc 35 36 (-0.03464548 0.01435063 0.00000000)
    arc 51 52 (-0.04619398 0.01913417 0.00000000)
    arc 43 44 (-0.03464548 0.01435063 0.20000000)
    arc 59 60 (-0.04619398 0.01913417 0.20000000)
    arc 36 37 (-0.03464548 -0.01435063 0.00000000)
    arc 52 53 (-0.04619398 -0.01913417 0.00000000)
    arc 44 45 (-0.03464548 -0.01435063 0.20000000)
    arc 60 61 (-0.04619398 -0.01913417 0.20000000)
    arc 37 38 (-0.01435063 -0.03464548 0.00000000)
    arc 53 54 (-0.01913417 -0.04619398 0.00000000)
    arc 45 46 (-0.01435063 -0.03464548 0.20000000)
    arc 61 62 (-0.01913417 -0.04619398 0.20000000)
    arc 38 39 (0.01435063 -0.03464548 0.00000000)
    arc 54 55 (0.01913417 -0.04619398 0.00000000)
    arc 46 47 (0.01435063 -0.03464548 0.20000000)
    arc 62 63 (0.01913417 -0.04619398 0.20000000)
    arc 39 32 (0.03464548 -0.01435063 0.00000000)
    arc 55 48 (0.04619398 -0.01913417 0.00000000)
    arc 47 40 (0.03464548 -0.01435063 0.20000000)
    arc 63 56 (0.04619398 -0.01913417 0.20000000)
);

boundary
(
    bottom
    {
        type patch;
        faces
        (
            (0 16 17 1)
            (1 17 18 2)
            (2 18 19 3)
            (3 19 20 4)
            (4 20 21 5)
            (5 21 22 6)
            (6 22 23 7)
            (7 23 16 0)
            (32 48 49 33)
            (33 49 50 34)
            (34 50 51 35)
            (35 51 52 36)
            (36 52 53 37)
            (37 53 54 38)
            (38 54 55 39)
            (39 55 48 32)
        );
    }

    top
    {
        type patch;
        faces
        (
            (8 24 25 9)
            (9 25 26 10)
            (10 26 27 11)
            (11 27 28 12)
            (12 28 29 13)
            (13 29 30 14)
            (14 30 31 15)
            (15 31 24 8)
            (40 56 57 41)
            (41 57 58 42)
            (42 58 59 43)
            (43 59 60 44)
            (44 60 61 45)
            (45 61 62 46)
            (46 62 63 47)
            (47 63 56 40)
        );
    }

    innerWall
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (3 4 12 11)
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
            (7 0 8 15)
        );
    }

    outerWall
    {
        type wall;
        faces
        (
            (48 49 57 56)
            (49 50 58 57)
            (50 51 59 58)
            (51 52 60 59)
            (52 53 61 60)
            (53 54 62 61)
            (54 55 63 62)
            (55 48 56 63)
        );
    }

    GGI_inner
    {
        type            ggi;
        shadowPatch     GGI_outer;
        zone            GGI_inner_zone;
        bridgeOverlap   false;
        rotationAxis    (0 0 1);
        rotationAngle   0;
        separationOffset (0 0 0);
        faces
        (
            (16 17 25 24)
            (17 18 26 25)
            (18 19 27 26)
            (19 20 28 27)
            (20 21 29 28)
            (21 22 30 29)
            (22 23 31 30)
            (23 16 24 31)
        );
    }

    GGI_outer
    {
        type            ggi;
        shadowPatch     GGI_inner;
        zone            GGI_outer_zone;
        bridgeOverlap   false;
        rotationAxis    (0 0 1);
        rotationAngle   0;
        separationOffset (0 0 0);
        faces
        (
            (32 33 41 40)
            (33 34 42 41)
            (34 35 43 42)
            (35 36 44 43)
            (36 37 45 44)
            (37 38 46 45)
            (38 39 47 46)
            (39 32 40 47)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
