cases/taylor-couette-3d/constant/MRFZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      MRFZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// Moving Reference Frame (MRF) zone for inner rotating cylinder
// Rotation about z-axis at Ω = 10 rad/s
//
// By default, all patches move with the MRF zone
// List patches that should NOT rotate in nonRotatingPatches

1
(
    rotor
    {
        // Patches that should NOT rotate (stationary patches)
        // innerWall rotates with MRF zone, so not listed here
        // GGI patches handled automatically at interface
        nonRotatingPatches ( outerWall top bottom );

        origin    origin [0 1 0 0 0 0 0]  (0 0 0);
        axis      axis   [0 0 0 0 0 0 0]  (0 0 1);
        omega     omega  [0 0 -1 0 0 0 0] 10;
    }
);

// ************************************************************************* //
